"""
Напишите программу, которая запрашивает год и проверяет его на високосность.
Распишите все возможные проверки в цепочке elif
Откажитесь от магических чисел
Обязательно учтите год ввода Григорианского календаря
В коде должны быть один input и один print
"""

year = int(input('Введите год: '))
res = None
if year % 4 == 0:
    if year % 400 == 0:
        res = 'Год високосный'
    elif year % 100 == 0:
        res = 'Год не високосный'
    else:
        res = 'Год високосный'
else:
    res = 'Год не високосный'
print(res)
