"""
Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
Используйте правило для проверки: «Число является простым, если делится нацело только на единицу и на себя».
Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
"""

count = 0

while True:
    num = int(input('Введите целое число от 0 до 100000: '))
    if num < 0 or num > 100000:
        print("Неверный ввод.")
    else:
        break

if 0 < num <= 100000:
    for i in range(2, num // 2 + 1):
        if num % i == 0:
            count = count + 1
    if count <= 0:
        print(f'Число является простым')
    else:
        print(f'Число является составным')
